app/Controllers/BarangController.php

SELECT *
FROM `units`
SELECT *
FROM `types`
---
    public function index(){

        $unitModel = new SatuanModel();
        $typesModel = new JenisModel();

        return $this->view('master.barang', [
                    'units'=> $unitModel->findAll(),
                    'types'=> $typesModel->findAll()
                ]);