app/Controllers/PrintController.php

    public function outgoing(){
        $no = 1;
        $table = '';
        $pdf = new Pdf();
        $model = new OutgoingModel();
        $model->orderBy('id', 'desc');
        $qty = $model->findAll();
---
SELECT *
FROM `outgoings`
ORDER BY `id` DESC

    public function stock(){
        $no = 1;
        $table = '';
        $pdf = new Pdf();
        $model = new BarangModel();
        $products = $model->list()->findAll();

        foreach($products as $val){
            $entrance = new EntranceDetailModel();
            $in = $entrance->selectSum('qty')->where('product_id',$val['id'])->get()->getRow();

            $outgoing = new OutgoingDetailModel();
            $out = $outgoing->selectSum('qty')->where('product_id',$val['id'])->get()->getRow();

            $stock = intval($in->qty)-intval($out->qty);

            $table .= '<tr>';
            $table .= '<td>'.$no.'</td>';
            $table .= '<td>'.$val['name'].'</td>';
            $table .= '<td>'.$val['unit'].'</td>';
            $table .= '<td>'.$val['unit'].'</td>';
            $table .= '<td>'.$stock.'</td>';
            $table .= '</tr>';
            $no++;
        }

        $unitModel = new SatuanModel();
        $typesModel = new JenisModel();

        return $pdf->generate(view('print/stock',[
                   'table'=>$table,
                   'units'=> $unitModel->findAll(),
                   'types'=> $typesModel->findAll()]), 'laporan-stock', 'potrait');
---
SELECT *
FROM `types`
SELECT *
FROM `units`