app/Controllers/ReportController.php

SELECT *
FROM `suppliers`
SELECT *
FROM `entrances`
WHERE `supplier_id` = '1'
---
    public function entrance(){
        $pemasok = $this->request->getGet('pemasok');

        $entranceModel = new EntranceModel();
        $supplierModel = new PemasokModel();
        $suppliers = $supplierModel->findAll();

//        if(!empty($suppliers)){
//            foreach ($suppliers as $row){
//
//                if($pemasok == $row['id']){
//
//                    $optSuppliers .= '<option value="'.$row['id'].'" selected>'.$row['name'].'</option>';
//                }else{
//                    $optSuppliers .= '<option value="'.$row['id'].'">'.$row['name'].'</option>';
//                }
//            }
//        }

        $no = 1;
        $entrances = [];

        if(!empty($pemasok)){
            $entrances = $entranceModel->where('supplier_id', $pemasok)->findAll();

SELECT *
FROM `outgoings`
ORDER BY `id` DESC
---
    public function outgoing(){
        $no = 1;
        $table = '';
        $model = new OutgoingModel();
        $model->orderBy('id', 'desc');
        $qty = $model->findAll();